In [4]:
import pandas as pd
import pandas as np 

data ={
    "id": [ 101, 102, 103,104, 105],
    "name": ["phuongtuan","j97", None, "dom dom", "meo meo" ],
    "age": [26,18,20, None,19 ],
    "salary": [10, 20, 30, 40, None]
}
df=pd.DataFrame(data)
df

    id        name   age  salary
0  101  phuongtuan  26.0    10.0
1  102         j97  18.0    20.0
2  103        None  20.0    30.0
3  104     dom dom   NaN    40.0
4  105     meo meo  19.0     NaN

điền giá trị thiếu trong cột age bằng giá trị age trung bình
loại bỏ các dòng chứa dữ liệu thiếu 
điền giá trị thiếu trong name bằng unknow 
điền giá trị thiếu trong salary bằng phương pháp interpolation

In [17]:
#điền giá trị thiếu trong cột age bằng giá trị age trung bình
tb= df["age"].mean()
tb

np.float64(20.75)

In [6]:
#loại bỏ các dòng chứa dữ liệu thiếu 
lb = df.dropna()
lb

    id        name   age  salary
0  101  phuongtuan  26.0    10.0
1  102         j97  18.0    20.0

In [7]:
#điền giá trị thiếu trong name bằng unknow 
name = df['name'].fillna('unknown')
name

0    phuongtuan
1           j97
2       unknown
3       dom dom
4       meo meo
Name: name, dtype: object

In [ ]:
#điền giá trị thiếu trong salary bằng phương pháp interpolation
lost = df['salary'].interpolate(methode="linear",inplace=True )
lost

0    10.0
1    20.0
2    30.0
3    40.0
4    40.0
Name: salary, dtype: float64

In [23]:
#cho data
df1= pd.DataFrame({
    "id":[1,2,3],
    "score_A":[70,90,85]
       
})
df2= pd.DataFrame({
    "id":[3,4,5],
    "score_B":[62,91,75]
       
})

In [27]:
#thuc hien merg tren cot id(iner join, left join, out join)
inner = pd.merge(df1, df2, on='id', how='inner') 
inner
left= pd.merge(df1, df2, on='id', how='left') 
left
out= pd.merge(df1, df2, on='id', how='outer')
out

   id  score_A  score_B
0   1     70.0      NaN
1   2     90.0      NaN
2   3     85.0     62.0
3   4      NaN     91.0
4   5      NaN     75.0

In [28]:
# noi Data frame theo chieu doc
noi = pd.concat([df1, df2], ignore_index=True) 
noi

   id  score_A  score_B
0   1     70.0      NaN
1   2     90.0      NaN
2   3     85.0      NaN
3   3      NaN     62.0
4   4      NaN     91.0
5   5      NaN     75.0

In [32]:
# gop df1 va df2 de dien gia tri theu
df1.set_index("id").combine_first(df2.set_index("id")).reset_index()

   id  score_A  score_B
0   1     70.0      NaN
1   2     90.0      NaN
2   3     85.0     62.0
3   4      NaN     91.0
4   5      NaN     75.0

In [ ]:
#cho data
pc= pd.DataFrame({
    "id": range(1,1000000),
    "Value": np.random.randn(1,100,1000000)
})

In [34]:
#dung .astype de toi uu bo nho
pc["id"]= pc["id"].astype("int32")
pc["Value"]= pc["Value"].astype("float32")

NameError: name 'pc' is not defined

In [ ]:
#tim 5 gia tri pho bien nhat trong cot Value
pc["Value"].value_counts().head(5)

In [ ]:
#su dung query de loc
pc.query("Value > 90")